README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-28 mar. 06:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Malik Koné" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org34efe9b">1. Projet Blockchain (en python)</a>
<ul>
<li><a href="#org2762672">1.1. Pré-requis</a>
<ul>
<li><a href="#org1e03642">1.1.1. Créer un environnement virtuel (et l'activer)</a></li>
<li><a href="#orgd13d0dd">1.1.2. Télécharger le code</a></li>
</ul>
</li>
<li><a href="#orgc8bde9d">1.2. Lancement</a>
<ul>
<li><a href="#org6faa385">1.2.1. Variable d'environements</a></li>
<li><a href="#org5f7a79d">1.2.2. En local</a></li>
<li><a href="#orgd12a96c">1.2.3. Avec un adresse accessible depuis l'internet</a></li>
<li><a href="#org5f8eefd">1.2.4. Exercices</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org34efe9b" class="outline-2">
<h2 id="org34efe9b"><span class="section-number-2">1</span> Projet Blockchain (en python)</h2>
<div class="outline-text-2" id="text-1">
<p>
Ce repertoire contient du code pour créer sa blockchain. Il a un objectif pédagogique et il est donc très commenté.  Il s'inspire d'un  <a href="https://developer.ibm.com/technologies/blockchain/tutorials/develop-a-blockchain-application-from-scratch-in-python/">tutoriel d'IBM</a>  en anglais, dont le code est aussi sur <a href="https://github.com/satwikkansal/python_blockchain_app/tree/master">ce répertoire git</a>.
</p>

<p>
Le code crée une application web avec le framework python <a href="https://palletsprojects.com/p/flask/">Flask</a> pour écrire, lire et partager des données sur une blockchain.  Il s'agit d'un serveur et un client blockchain.
</p>

<p>
Il n'y a pas de meilleure manière d'apprendre ce qu'est la blockchain que d'en construire une.
</p>

<p>
Le code peut être copié et testé localement, puis sur différentes machines distantes à l'aide d'un service comme <a href="https://ngrok.com">ngrok</a>  qui permet de rendre une adresse réseau locale visible depuis sur internet.
</p>
</div>


<div id="outline-container-org2762672" class="outline-3">
<h3 id="org2762672"><span class="section-number-3">1.1</span> Pré-requis</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Assurez-vous d'avoir une version récente de python (par exemple 3.8) et que virtualenv est installé.
Executant dans un terminal.
</p>
<div class="org-src-container">
<pre class="src src-bash">$ python --vesrion
Python 3.8.2

$ virtualenv --version
virtualenv 20.0.23 from ...
</pre>
</div>

<p>
<i>Notez que je distingue ici l'invite de commande Linux et windows et les commentaires avec respectivement '$',  '&gt;' et '#'.  Si rien n'est spécifié c'est probablement exactement les même commandes ou alors c'est qu'il s'agit du retour d'une commande.</i>
</p>
</div>

<div id="outline-container-org1e03642" class="outline-4">
<h4 id="org1e03642"><span class="section-number-4">1.1.1</span> Créer un environnement virtuel (et l'activer)</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Linux
</p>
<div class="org-src-container">
<pre class="src src-bash">$ virtualenv &lt;VosInitiales&gt;Envs
$ cd &lt;VosInitiales&gt;Envs
$ source bin/activate
</pre>
</div>
<p>
Windows
</p>
<div class="org-src-container">
<pre class="src src-bash">&gt; virtualenv &lt;VosInitiales&gt;Envs
&gt; cd &lt;VosInitiales&gt;Envs
&gt; Scripts\activate
</pre>
</div>

<p>
Par la suite exécuter  pour désactiver votre environnement virtuel.
</p>
</div>
</div>


<div id="outline-container-orgd13d0dd" class="outline-4">
<h4 id="orgd13d0dd"><span class="section-number-4">1.1.2</span> Télécharger le code</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Assurez-vous d'avoir <a href="https://git-scm.com/download/win">git</a> installé 
</p>
<div class="org-src-container">
<pre class="src src-bash">$ git --version
git version 2.17.1
</pre>
</div>
<p>
puis exécutez
</p>
<div class="org-src-container">
<pre class="src src-bash">$ git clone https://github.com/maliky/blockchain.git
$ cd blockchain  <span style="color: #cd853f;"># </span><span style="color: #cd853f;">ou pour windows, dir blockchain</span>
</pre>
</div>

<p>
Vous pourez ensuite mettre à jour le code simplement avec
</p>
<div class="org-src-container">
<pre class="src src-bash">$ git pull 
<span style="color: #cd853f;"># </span><span style="color: #cd853f;">ou, $ git pull origin master</span>
</pre>
</div>

<p>
Installer les bibliothèques nécessaires
</p>
<div class="org-src-container">
<pre class="src src-bash">$ pip install -r requirements.txt
</pre>
</div>

<p>
Vous êtes prêt à lancer le programme
</p>
</div>
</div>
</div>

<div id="outline-container-orgc8bde9d" class="outline-3">
<h3 id="orgc8bde9d"><span class="section-number-3">1.2</span> Lancement</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org6faa385" class="outline-4">
<h4 id="org6faa385"><span class="section-number-4">1.2.1</span> Variable d'environements</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
N'oubliez pas cette étape.  Elle est importante et doit être effectué à chaque démarrage de votre machine.
</p>

<p>
Pour Linux
</p>
<div class="org-src-container">
<pre class="src src-bash">$ export <span style="color: #9acd32;">FLASK_APP</span>=noeud_serveur
</pre>
</div>

<p>
Pour Windows (cmd.exe) faire
</p>
<div class="org-src-container">
<pre class="src src-bash">&gt; set <span style="color: #9acd32;">FLASK_APP</span>=noeud_serveur
</pre>
</div>

<p>
pour Windows Powerhsell voir <a href="https://flask.palletsprojects.com/en/1.1.x/cli/#application-discovery">la doc du projet Flask</a>.
</p>
</div>
</div>

<div id="outline-container-org5f7a79d" class="outline-4">
<h4 id="org5f7a79d"><span class="section-number-4">1.2.2</span> En local</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<div id="outline-container-org983c06f" class="outline-5">
<h5 id="org983c06f"><span class="section-number-5">1.2.2.1</span> Lancer le serveur</h5>
<div class="outline-text-5" id="text-1-2-2-1">
<div class="org-src-container">
<pre class="src src-bash">flask run --port 8000
</pre>
</div>
<p>
Le noeud serveur est maintenant accessible en local à l'adresse <a href="http://127.0.0.1:8000">http://127.0.0.1:8000</a> .
</p>

<p>
Lors des tests à distance, (après avoir installé ngrok), vous devrez changer cette adresse en modifiant la variable ADRESSE_NOEUD_SERVEUR dans <a href="app/client.py">app/client.py</a>
</p>
</div>
</div>

<div id="outline-container-org1ee2b57" class="outline-5">
<h5 id="org1ee2b57"><span class="section-number-5">1.2.2.2</span> Lancer le client</h5>
<div class="outline-text-5" id="text-1-2-2-2">
<p>
Ouvrez un autre terminal puis aller dans le dossier '&lt;VosInitiales&gt;Envs'
</p>

<div class="org-src-container">
<pre class="src src-bash">&gt; cd \votre\chemin\pour<span style="color: #ffa07a;">\&lt;</span>VosInitiales&gt;Envs
</pre>
</div>

<p>
activez l'environnement virtuel
</p>

<div class="org-src-container">
<pre class="src src-bash">&gt; Scripts\activate
</pre>
</div>

<p>
aller dans le dossier blockchain
</p>

<div class="org-src-container">
<pre class="src src-bash">&gt; cd blockchain
</pre>
</div>

<p>
puis lancer l'application cliente avec
</p>

<div class="org-src-container">
<pre class="src src-bash">&gt; python lance_client.py
</pre>
</div>

<p>
L'interface est accessible a <a href="http://localhost:5000">http://localhost:5000</a> 
</p>
</div>
</div>
</div>

<div id="outline-container-orgd12a96c" class="outline-4">
<h4 id="orgd12a96c"><span class="section-number-4">1.2.3</span> Avec un adresse accessible depuis l'internet</h4>
<div class="outline-text-4" id="text-1-2-3">
</div>
<div id="outline-container-org4fbb9bc" class="outline-5">
<h5 id="org4fbb9bc"><span class="section-number-5">1.2.3.1</span> Créer un accès (temporaire) à notre serveur local depuis internet</h5>
<div class="outline-text-5" id="text-1-2-3-1">
<p>
S'inscrire sur <a href="https://ngrok.com">ngrok.com</a> et suivre les instructions du site
</p>
</div>
</div>


<div id="outline-container-org5739e83" class="outline-5">
<h5 id="org5739e83"><span class="section-number-5">1.2.3.2</span> Utiliser curl pour ajouter les autres noeuds serveur</h5>
<div class="outline-text-5" id="text-1-2-3-2">
<div class="org-src-container">
<pre class="src src-bash">curl -X POST <span style="color: #ffa07a;">\</span>
  &lt;address.ngrok.de.votre.partenair&gt;/senregistrer_aupres <span style="color: #ffa07a;">\</span>
  -H <span style="color: #ffa07a;">'Content-Type: application/json'</span> <span style="color: #ffa07a;">\</span>
  -d <span style="color: #ffa07a;">'{"adresse": "http://votre.adresse.ngrok ou http://127.0.0.1:8000"}'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5f8eefd" class="outline-4">
<h4 id="org5f8eefd"><span class="section-number-4">1.2.4</span> Exercices</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Décommenter les codes dans client.py et essayer d'ajouter une interface pour s'enregistrer aurpès des autres noeuds.
via l'interface cliente
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Malik Koné</p>
<p class="date">Created: 2020-07-28 mar. 06:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
